Repository: MuchaSsak/muszarski.space
Catalog: src/locales/*/messages.po
Languages: pl

source: for amateur photography of those places
pl: dla amatorskiej fotografii tych miejsc

source: 2D Space Portfolio
pl: 2D Kosmiczne Portfolio

source: 3D screensaver for a sports club using GPGPU computing in R3F ⚡
pl: 3D wygaszacz ekranu dla klubu sportowego używając kalkulacji GPGPU w R3F ⚡

source: A foreign language learning app for vocabulary reinforcement by typing ⌨️
pl: Aplikacja do nauki słownictwa języków obcych poprzez pisanie na klawiaturze ⌨️

source: A fully animated Next.js portfolio with the help of ThreeJS, Framer Motion, shadcn/ui and clever usage of .webm videos 🌌
pl: W pełni animowane Next.js portfolio wykonane za pomocą Three.js, Motion, shadcn/ui oraz sprytnych użyć filmów .webm 🌌

source: A react library full of highly customizable and animated buttons out of the box. This project includes an SPA for documentation and an NPM package 👉
pl: Biblioteka do React pełna wysoko personalizowalnych i animowanych przycisków przygotowanych od razu dla developera. Ten projekt zawiera SPA dla dokumentacji oraz paczkę NPM 👉

source: A website including 3D features made to promote a beautiful organiation in Luxemburg
pl: Strona internetowa zawierająca 3D aspekty zrobiona dla promowania pięknej organizacji zlokalizowanej w Luksemburgu

source: About me
pl: O mnie

source: adaptibility
pl: zdolność adaptacji

source: Alternative Participation of Rural Youth in Bakuriani, Georgia
pl: Alternatywny Udział Wiejskiej Młodzieży w Bakuriani, Gruzja

source: An SPA for managing your finances by taking track of your budgets and expenses. Utilizes the browser's localStorage and advanced UI state using React's Context API with useReducer 💸
pl: SPA dla zarządzania swoimi finansami poprzez notowanie budżetów oraz wydatków. Wykorzystuje lokalne dane przeglądarkowe oraz zaawansowany system dla UI state za pomocą React Context API oraz useReducer 💸

source: analyzing nearby threats to the animals and getting rid of them
pl: analizowanie zagrożeń dla zwierząt i eliminowanie ich

source: are licensed under
pl: są pod licencją

source: attending meetings with volunteers
pl: uczestnictwo w spotkaniach z wolontariuszami

source: attending mentor on-site and onine meetings
pl: uczestnictwo w spotkaniach z mentorem, na miejscu jak i online

source: Audio settings
pl: Ustawienia dźwięku

source: Beniaminek 03 Screensaver
pl: Beniaminek 03 Wygaszacz Ekranu

source: Beyond technology, I enjoy a range of other activites including working out, traveling, photography, swimming and many more!
pl: Poza technologią lubię wiele innych aktywności, takich jak ćwiczenia, podróżowanie, fotografia, pływanie i wiele więcej!

source: Bike courier
pl: Kurier rowerowy

source: But I've been to a bunch of
pl: Ale byłem też w

source: by
pl: od

source: Cancel
pl: Anuluj

source: Certificates
pl: Certyfikaty

source: Check out my
pl: Zobacz mój

source: check out my older portfolio 🚀
pl: sprawdź moje stare portfolio 🚀

source: Cheers to them!
pl: Brawa dla nich!

source: cleaning up local beaches from garbage
pl: sprzątanie lokalnych plaż z odpadów

source: click here.
pl: kliknij tutaj.

source: Click on the asteroids for more details!
pl: Kliknij asteroidy, aby zobaczyć więcej szczegółów!

source: Close
pl: Zamknij

source: Contact
pl: Kontakt

source: Couldn't find results
pl: Nie znaleziono wyników

source: creating spreadsheets
pl: tworzenie arkuszy kalkulacyjnych

source: Credits 💖
pl: Podziękowania 💖

source: cycling
pl: jazda na rowerze

source: Delivering orders via the partnered mobile application — Glovo.
pl: Dostarczanie zamówień przez partnerską aplikację mobilną — Glovo.

source: Deploying...
pl: Przygotowywanie...

source: Deploying....
pl: Przygotowywanie...

source: Deploying.....
pl: Przygotowywanie...

source: developing a website
pl: tworzenie strony internetowej

source: Developing Infrastructure to Work with Youth in Daugirdiškės, Lithuania
pl: Wykorzystywanie Infrastruktury do Działań z Młodzieżą w Daugirdiškės, Lithuania

source: Digital Youth Work Methods in Saraiķi, Latvia
pl: Metody Cyfrowej Pracy Młodzieży w Saraiķi, Latvia

source: Do you want to reset all settings?
pl: Czy chcesz zresetować wszystkie ustawienia?

source: Download résumé
pl: Pobierz CV

source: e.g. Order for a website
pl: np. Zamówienie witryny internetowej

source: Enable sounds
pl: Włącz dźwięk

source: European Solidarity Corps group volunteer
pl: Wolontariusz grupowy Europejskiego Korpusu Solidarności

source: flexibility
pl: elastyczność

source: For a more responsive and lighter website,
pl: Dla bardziej responsywnej oraz lżejszej witryny,

source: foreign languages
pl: języki obce

source: from
pl: z

source: front-end development
pl: programowanie front-end

source: Graphics settings
pl: Ustawienia graficzne

source: helpfulness
pl: pomocność

source: helping other employees with various problems
pl: pomoc innym pracownikom w rozwiązywaniu różnych problemów

source: High graphics
pl: Wysoka grafika

source: I am writing to you because...
pl: Piszę do Ciebie, ponieważ...

source: I originate from Poland
pl: Pochodzę z Polski

source: If you wish to ignore this warning and proceed anyway,
pl: Jeżeli wolisz zignorować to ostrzeżenie i kontynuować,

source: is licensed under
pl: jest pod licencją

source: It appears that your device is incompatible with this experience. This warning is caused by your screen resolution being smaller in width than recommended. It's likely you're viewing this on a mobile device, which is problematic for this 3D web application mainly for two reasons:
pl: Wygląda na to że twoje urządzenie jest niekompatybilne z tym doświadczeniem. To ostrzeżenie ma miejsce przez mniejszą szerokość twojego ekranu niż zalecana. Prawdopodobnie widzisz to na urządzeniu mobilnym, co jest problematyczne dla tej 3D aplikacji witrynowej głównie z dwóch powodów:

source: IT troubleshooting
pl: rozwiązywanie problemów IT

source: Job Experience
pl: Doświadczenie zawodowe

source: keeping the volunteers' living space tidy
pl: utrzymywanie porządku w przestrzeni mieszkalnej wolontariuszy

source: language
pl: język

source: Learn more
pl: Dowiedz się więcej

source: Low graphics
pl: Niska grafika

source: Message
pl: Wiadomość

source: Message must be at least 3 characters long.
pl: Wiadomość musi zawierać conajmniej 3 znaki.

source: Message must be at max 2048 characters long.
pl: Wiadomość nie może przekraczać 2048 znaków.

source: monitoring sea turtles nests
pl: monitorowanie gniazd żółwi morskich

source: Music by
pl: Muzyka od

source: My name's Mateusz Muszarski and I'm passionate about programming as well as computer-science. Currently, I'm studying as programming technician in my technical college.
pl: Nazywam się Mateusz Muszarski i pasjonuję się programowaniem oraz informatyką. Obecnie uczę się jako technik programista w technikum.

source: My primary focus lies in full-stack and creative web development, however, I also learned the fundamentals in other digital areas such as 3D computer graphics, graphic design, photo or video editing.
pl: Moim głównym zainteresowaniem jest full-stack i kreatywne tworzenie stron internetowych, jednak poznałem również podstawy w innych dziedzinach cyfrowych, takich jak grafika 3D, projektowanie graficzne, edycja zdjęć i filmów.

source: obeying traffic laws
pl: przestrzeganie przepisów drogowych

source: Oops!
pl: Ups!

source: OR
pl: LUB

source: other countries too!
pl: wielu innych krajach!

source: Planet textures by
pl: Tekstury planet od

source: Practices for programming and social skills.
pl: Praktyki z programowania i umiejętności społecznych.

source: Programmer (intern)
pl: Programista (praktykant)

source: Projects
pl: Projekty

source: promoting our home town and organizing events
pl: promowanie naszego miasta rodzinnego i organizacja wydarzeń

source: rescuing hatchlings
pl: ratowanie młodych żółwi

source: Rescuing threatened species of sea turtles and cleaning up the local environment alongside other foreign volunteers.
pl: Ratowanie zagrożonych gatunków żółwi morskich i sprzątanie lokalnego środowiska wraz z innymi zagranicznymi wolontariuszami.

source: Reset all
pl: Zresetuj wszystko

source: SCROLL
pl: PRZEWIŃ

source: Search
pl: Szukaj

source: self-motivation
pl: automotywacja

source: Send
pl: Wyślij

source: Show less
pl: Pokaż mniej

source: Show more, less relevant certificates
pl: Pokaż więcej, mniej odnośnych certyfikatów

source: Something went wrong with sending the mail!
pl: Coś poszło nie tak przy wysyłaniu maila!

source: Sound Effect by
pl: Efekt Dźwiękowy od

source: Source code 💻
pl: Kod źródłowy 💻

source: Starogard Gdański, Pomerania, Poland
pl: Starogard Gdański, Pomorskie, Polska

source: Subject
pl: Tytuł

source: Subject must be at least 3 characters long.
pl: Tytuł musi zawierać conajmniej 3 znaki.

source: Subject must be at max 64 characters long.
pl: Tytuł nie może przekraczać 64 znaków.

source: Successfully sent the mail!
pl: Pomyślnie wysłano mail!

source: taking pictures and videos for the national agency
pl: robienie zdjęć i nagrań dla agencji narodowej

source: technical support
pl: wsparcie techniczne

source: This action cannot be undone. This will permanently delete all of your local storage data and totally refresh the experience.
pl: Ta akcja nie może zostać odwrócona. To permanentnie usunie wszystkie twoje dane przeglądarkowe oraz totalnie odświeży doświadczenie.

source: time management
pl: zarządzanie czasem

source: verifying packages integrity
pl: sprawdzanie integralności paczek

source: View it live 🚀
pl: Odwiedź projekt 🚀

source: Visit LinkedIn
pl: Odwiedź LinkedIn

source: Visit old portfolio
pl: Odwiedź stare portfolio

source: Volume
pl: Głośność

source: writing and creating social media posts
pl: pisanie i tworzenie postów w mediach społecznościowych

source: Youth Entrepreneurship in Palanga, Lithuania
pl: Przedsiębiorczość Młodzieży w Palanga, Litwa
